# Pandas library
* Built on top of NumPy
* Allows fast analysis, data cleaning, and analysis
* Performance and productivity excells
* It has built-in visualization features

**tip: shift + tab to see more info**

In [4]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c']

In [4]:
my_data = [10,20,30]

### Normal way

In [5]:
arr = np.array(my_data)

In [6]:
d = {'a':10,'b':20,'c':30}

In [7]:
d

{'a': 10, 'b': 20, 'c': 30}

### VS Pandas way

In [8]:
pd.Series(labels, my_data)

10    a
20    b
30    c
dtype: object

In [9]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

## DataFrames
Just a bunch of series

In [10]:
np.random.seed(101)

In [5]:
df = pd.DataFrame(np.random.randn(5,4), ["A", "B", "C", "D", "E"],["W","X","Y","Z"])

In [12]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
type(df["W"])

pandas.core.series.Series

In [15]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

axis = 0 means rows
axis = 1 means collumns

In [16]:
df["new"] = df["X"] + df["Y"]

In [17]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [18]:
df.drop('new', axis=1, inplace=True)

In [19]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

"inplace" is to save changes made to column (to prevent accidental changes)

In [20]:
df.drop("E")

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

##### Selecting columns

In [21]:
df[["W", "Y"]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

#### Selecting rows

In [22]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [24]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [25]:
df.loc['B', 'Y']

-0.8480769834036315

In [26]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [28]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
df[df["W"]>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df[df["W"]>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [31]:
df[df["W"]>0][['X', 'Y']].loc["A"]

X    0.628133
Y    0.907969
Name: A, dtype: float64

In [6]:
df[(df["W"]>0) & (df["Y"]>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [7]:
df

          W         X         Y         Z
A -1.669365 -0.553542 -0.305797  0.340936
B -0.700834 -0.421252 -1.587911 -0.724495
C -0.209003  0.195812  0.388363  0.082126
D -0.983677  0.465774  0.159845 -0.272530
E  1.015769  0.339156  0.517869  1.351453

#### Reset index

In [8]:
df.reset_index()

  index         W         X         Y         Z
0     A -1.669365 -0.553542 -0.305797  0.340936
1     B -0.700834 -0.421252 -1.587911 -0.724495
2     C -0.209003  0.195812  0.388363  0.082126
3     D -0.983677  0.465774  0.159845 -0.272530
4     E  1.015769  0.339156  0.517869  1.351453

In [9]:
newind = "CA NY WY OR CO".split()

In [10]:
df["States"] = newind

In [11]:
df

          W         X         Y         Z States
A -1.669365 -0.553542 -0.305797  0.340936     CA
B -0.700834 -0.421252 -1.587911 -0.724495     NY
C -0.209003  0.195812  0.388363  0.082126     WY
D -0.983677  0.465774  0.159845 -0.272530     OR
E  1.015769  0.339156  0.517869  1.351453     CO

In [13]:
df.set_index('States', inplace=True)

In [14]:
df

               W         X         Y         Z
States
CA     -1.669365 -0.553542 -0.305797  0.340936
NY     -0.700834 -0.421252 -1.587911 -0.724495
WY     -0.209003  0.195812  0.388363  0.082126
OR     -0.983677  0.465774  0.159845 -0.272530
CO      1.015769  0.339156  0.517869  1.351453

----------------------------------------

In [15]:
import numpy as np
import pandas as pd

In [16]:
outside = 'G1 G1 G1 G2 G2 G2'.split()

In [17]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [21]:
inside = [1,2,3,1,2,3]

In [22]:
hier_index = list(zip(outside,inside))

In [23]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [24]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [27]:
df = pd.DataFrame(np.random.randn(6,2),hier_index,['A','B'])

In [28]:
df

             A         B
G1 1  0.592209 -0.232270
   2  0.581881  0.532611
   3  0.695897 -2.243271
G2 1  0.332167  1.691174
   2  0.058961  0.275764
   3 -0.529129  1.222375

In [29]:
df.loc['G1']

          A         B
1  0.592209 -0.232270
2  0.581881  0.532611
3  0.695897 -2.243271

In [30]:
df.loc["G1"]["A"]

1    0.592209
2    0.581881
3    0.695897
Name: A, dtype: float64

In [33]:
df

             A         B
G1 1  0.592209 -0.232270
   2  0.581881  0.532611
   3  0.695897 -2.243271
G2 1  0.332167  1.691174
   2  0.058961  0.275764
   3 -0.529129  1.222375

In [34]:
df.index.names

FrozenList([None, None])

In [35]:
df.index.names = 'Groups Num'.split()

In [36]:
df.index.names

FrozenList(['Groups', 'Num'])

In [37]:
df['A']

Groups  Num
G1      1      0.592209
        2      0.581881
        3      0.695897
G2      1      0.332167
        2      0.058961
        3     -0.529129
Name: A, dtype: float64

In [38]:
df.loc['G1'].loc[1]

A    0.592209
B   -0.232270
Name: 1, dtype: float64

In [41]:
df

                   A         B
Groups Num
G1     1    0.592209 -0.232270
       2    0.581881  0.532611
       3    0.695897 -2.243271
G2     1    0.332167  1.691174
       2    0.058961  0.275764
       3   -0.529129  1.222375

#### Cross section

In [40]:
df.xs(1,level="Num")

               A         B
Groups
G1      0.592209 -0.232270
G2      0.332167  1.691174

# Missing Data

In [42]:
import numpy as np
import pandas as pd

In [43]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [44]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [45]:
df = pd.DataFrame(d)

In [46]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [47]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [48]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [49]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [50]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [51]:
df['B'].fillna(value=df['B'].mean())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

fillna <br>
dropna

# Groupby

* Allows you to group together rows based off of a column and perform an aggregate function on them

In [53]:
import numpy as np
import pandas as pd

In [55]:
data = {'Company': 'GOOG GOOG MSFT MSFT FB FB'.split(),
       'Person': 'Sam Charlie Amy Vanessa Carl Sarah'.split(),
       'Sales': [200,120,340,124,243,350]}

In [56]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [57]:
df = pd.DataFrame(data)

In [58]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [63]:
byComp = df.groupby('Company')

In [64]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [65]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [66]:
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [67]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [68]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [69]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [70]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

# Merging, Joining, and Concatenating

In [71]:
import pandas as pd

In [73]:
df1 = pd.DataFrame({'A': 'A0 A1 A2 A3'.split(),
                    'B': 'B0 B1 B2 B3'.split(),
                    'C': 'C0 C1 C2 C3'.split(),
                    'D': 'D0 D1 D2 D3'.split()},
                   index=[0,1,2,3])

In [78]:
df2 = pd.DataFrame({'A': 'A4 A5 A6 A7'.split(),
                    'B': 'B4 B5 B6 B7'.split(),
                    'C': 'C4 C5 C6 C7'.split(),
                    'D': 'D4 D5 D6 D7'.split()},
                   index=[4,5,6,7])

In [79]:
df3 = pd.DataFrame({'A': 'A8 A9 A10 A11'.split(),
                    'B': 'B8 B9 B10 B11'.split(),
                    'C': 'C8 C9 C10 C11'.split(),
                    'D': 'D8 D9 D10 D11'.split()},
                   index=[8,9,10,11])

In [80]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [81]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [82]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

It basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on.

In [83]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [86]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [87]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [88]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [89]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

## Merging

In [90]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

## Joining
Combined the collumns of two potentially differently-indexed DataFrames into a single result DataFrame (Rather join with index than a key).

In [92]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [93]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [94]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [95]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [96]:
left.join(right, how="outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operations

In [97]:
import numpy as np
import pandas as pd

In [98]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,777],
                  'col3':'abc def ghi xyz'.split()})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [99]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [100]:
df['col2'].nunique()

4

In [101]:
df['col2'].value_counts()

444    1
555    1
666    1
777    1
Name: col2, dtype: int64

#### Useful
* nunique
* value_counts

In [105]:
df[(df['col1']>2) & (df['col2']==444)]

Empty DataFrame
Columns: [col1, col2, col3]
Index: []